In [1]:
import pandas as pd
import re

This is just some basic practice with regex using capture and non-capture groups and lookaheads to isolate specific patterns within strings.

In [12]:
df = pd.DataFrame({
    'page_html': ['alaska-id34205.html', 'norway-id20543.html', 'lapland,id10293.html', 'jamaica,.;,id2039412.html', 'delicious.html']
})
df

                   page_html
0        alaska-id34205.html
1        norway-id20543.html
2       lapland,id10293.html
3  jamaica,.;,id2039412.html
4             delicious.html

In [13]:
df['ids'] = df.page_html.str.extract('(?:.*id)(\d+)(?:\.html)')


df

                   page_html      ids
0        alaska-id34205.html    34205
1        norway-id20543.html    20543
2       lapland,id10293.html    10293
3  jamaica,.;,id2039412.html  2039412
4             delicious.html      NaN

In [21]:
df1 = pd.DataFrame({
    'age': ['11th grade', '9th grade', '5th grade', '12th grade']
})
df1

          age
0  11th grade
1   9th grade
2   5th grade
3  12th grade

In [22]:
df1['grade'] = df1['age'].str.extract('(\d+)')

df1

          age grade
0  11th grade    11
1   9th grade     9
2   5th grade     5
3  12th grade    12